app/views/traditions/show.html.erb

SELECT "pictures".* FROM "pictures"  WHERE "pictures"."tradition_id" = ?  [["tradition_id", 9]]
---
<table class="table table-striped">
<% @tradition.pictures.each do |picture| %>