app/views/users/show.html.erb

  <tr>
    <% @user.traditions.each do |tradition| %>
---
SELECT "traditions".* FROM "traditions"  WHERE "traditions"."user_id" = ?  [["user_id", 1]]

      </td>
      <% tradition.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."tradition_id" = ?  [["tradition_id", 9]]