app/views/static/welcome.html.erb


				<% tradition.pictures.each do |picture| %>
---
SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."tradition_id" = ?  ORDER BY "pictures"."id" ASC LIMIT 1  [["tradition_id", 9]]