app/views/pictures/_form.html.erb

	<%= form.label :tradition %><br />
	<%= form.collection_select :tradition_id, Tradition.all, :id, :name %>
---
SELECT "traditions".* FROM "traditions"