app/controllers/pictures_controller.rb

	def create
		# get data from the form

		#give the data to the model
		#@picture = Picture.new(picture_params)
		@picture.user = current_user
		@picture.tradition = Tradition.find(params[:tradition_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]