app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("approved", "created_at", "tradition_id", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["approved", "t"], ["created_at", "2015-02-07 05:09:34.806367"], ["tradition_id", 1], ["updated_at", "2015-02-07 05:09:34.806367"], ["url", "test.jpg"], ["user_id", 1]]
---
	def create
		# get data from the form

		#give the data to the model
		#@picture = Picture.new(picture_params)
		@picture = @tradition.pictures.new(picture_params)
		@picture.user = current_user
		#save the model
		if @picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]
---
	def destroy
		#@picture = Picture.find(params[:id])
		@picture.destroy

SELECT  "traditions".* FROM "traditions"  WHERE "traditions"."id" = ? LIMIT 1  [["id", 2]]
---
    def load_tradition
      @tradition = Tradition.find(params[:tradition_id])