app/controllers/ratings_controller.rb

	def create
		# get data from the form
		#@rating.tradition = Tradition.find(params[:tradition_id])
		#give the data to the model
		#@rating = Rating.new(rating_params)
		@rating.user = current_user
		#save the model
		if @rating.save
---
INSERT INTO "ratings" ("created_at", "rating_number", "tradition_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-18 05:22:49.353637"], ["rating_number", 5], ["tradition_id", 4], ["updated_at", "2015-02-18 05:22:49.353637"], ["user_id", 1]]

	def destroy
		@rating.destroy
---
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 3]]