app/controllers/static_controller.rb

	def welcome
		@traditions = Tradition.all
---
SELECT "traditions".* FROM "traditions"