app/controllers/traditions_controller.rb

	def create
		# get data from the form

		#give the data to the model
		#@tradition = Tradition.new(tradition_params)
		@tradition.user = current_user
		#save the model
		if @tradition.save
---
INSERT INTO "traditions" ("approved", "created_at", "name", "picture", "poster", "ranking", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["approved", "f"], ["created_at", "2015-02-01 02:57:30.673078"], ["name", "test"], ["picture", "0"], ["poster", "Cody"], ["ranking", 4], ["updated_at", "2015-02-01 02:57:30.673078"]]

	def update
		#get data from form

		#find the existing tradition
		#@tradition = Tradition.find(params[:id])
		#update the tradition with new params
		@tradition.update(tradition_params)
---
UPDATE "traditions" SET "description" = ?, "name" = ?, "updated_at" = ? WHERE "traditions"."id" = 9  [["description", "Fire Blazing Good TIme"], ["name", "BBQ"], ["updated_at", "2015-03-03 06:10:00.476531"]]

	def destroy
		#@tradition = Tradition.find(params[:id])
		@tradition.destroy
---
DELETE FROM "traditions" WHERE "traditions"."id" = ?  [["id", 1]]