app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "graduation_year", "major", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-02-09 19:38:15.687791"], ["email", "codybrowncit@gmail.com"], ["graduation_year", 2015], ["major", "CIT"], ["name", "Cody Brown"], ["updated_at", "2015-02-09 19:38:15.687791"]]
---
	def create
		# get data from the form

		#give the data to the model
		@user = User.new(user_params)
		#save the model
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "graduation_date" = ?, "major" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["graduation_date", nil], ["major", ""], ["updated_at", "2015-02-02 23:22:17.502869"]]
---
	def update
		#get data from form

		#find the existing user
		@user = User.find(params[:id])
		#update the user with new params
		@user.update(user_params)